docs/benchmark/results-wrk2/raw/nginx-R120000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.51ms   40.13ms 452.61ms   92.34%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.71ms
 75.000%   25.06ms
 90.000%   48.77ms
 99.000%  219.90ms
 99.900%  310.78ms
 99.990%  371.20ms
 99.999%  423.68ms
100.000%  452.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.090     0.000000            1         1.00
       1.164     0.100000       104787         1.11
       1.981     0.200000       209451         1.25
       3.665     0.300000       314147         1.43
       7.551     0.400000       418793         1.67
      11.711     0.500000       523619         2.00
      13.807     0.550000       575952         2.22
      16.095     0.600000       628241         2.50
      18.671     0.650000       680596         2.86
      21.599     0.700000       732944         3.33
      25.055     0.750000       785293         4.00
      27.071     0.775000       811506         4.44
      29.407     0.800000       837555         5.00
      32.255     0.825000       863751         5.71
      35.743     0.850000       889968         6.67
      40.447     0.875000       916071         8.00
      43.871     0.887500       929201         8.89
      48.767     0.900000       942247        10.00
      55.359     0.912500       955346        11.43
      65.279     0.925000       968416        13.33
      80.767     0.937500       981525        16.00
      87.679     0.943750       988036        17.78
      99.775     0.950000       994571        20.00
     113.215     0.956250      1001113        22.86
     125.503     0.962500      1007661        26.67
     142.719     0.968750      1014212        32.00
     152.319     0.971875      1017515        35.56
     160.639     0.975000      1020769        40.00
     170.367     0.978125      1024019        45.71
     182.015     0.981250      1027297        53.33
     193.919     0.984375      1030563        64.00
     200.575     0.985938      1032214        71.11
     206.719     0.987500      1033851        80.00
     214.783     0.989062      1035483        91.43
     223.487     0.990625      1037107       106.67
     233.471     0.992188      1038746       128.00
     238.847     0.992969      1039571       142.22
     244.863     0.993750      1040381       160.00
     251.391     0.994531      1041196       182.86
     257.919     0.995313      1042018       213.33
     264.959     0.996094      1042833       256.00
     269.311     0.996484      1043248       284.44
     273.151     0.996875      1043644       320.00
     277.503     0.997266      1044062       365.71
     282.623     0.997656      1044476       426.67
     289.023     0.998047      1044882       512.00
     292.095     0.998242      1045084       568.89
     296.191     0.998437      1045280       640.00
     300.287     0.998633      1045492       731.43
     305.407     0.998828      1045696       853.33
     311.295     0.999023      1045894      1024.00
     315.135     0.999121      1045998      1137.78
     318.719     0.999219      1046102      1280.00
     322.559     0.999316      1046205      1462.86
     326.911     0.999414      1046304      1706.67
     332.287     0.999512      1046405      2048.00
     335.615     0.999561      1046459      2275.56
     338.175     0.999609      1046507      2560.00
     341.247     0.999658      1046559      2925.71
     344.063     0.999707      1046613      3413.33
     347.647     0.999756      1046662      4096.00
     349.951     0.999780      1046689      4551.11
     352.255     0.999805      1046711      5120.00
     357.887     0.999829      1046739      5851.43
     362.495     0.999854      1046762      6826.67
     365.567     0.999878      1046788      8192.00
     368.639     0.999890      1046800      9102.22
     371.711     0.999902      1046813     10240.00
     374.527     0.999915      1046826     11702.86
     378.367     0.999927      1046840     13653.33
     381.183     0.999939      1046852     16384.00
     383.743     0.999945      1046860     18204.44
     386.047     0.999951      1046864     20480.00
     390.911     0.999957      1046871     23405.71
     392.959     0.999963      1046877     27306.67
     401.407     0.999969      1046884     32768.00
     403.199     0.999973      1046887     36408.89
     404.479     0.999976      1046890     40960.00
     406.015     0.999979      1046893     46811.43
     407.551     0.999982      1046896     54613.33
     415.231     0.999985      1046900     65536.00
     419.583     0.999986      1046901     72817.78
     421.631     0.999988      1046903     81920.00
     422.143     0.999989      1046904     93622.86
     424.191     0.999991      1046906    109226.67
     426.495     0.999992      1046908    131072.00
     426.495     0.999993      1046908    145635.56
     427.263     0.999994      1046909    163840.00
     428.543     0.999995      1046910    187245.71
     428.799     0.999995      1046911    218453.33
     431.615     0.999996      1046912    262144.00
     431.615     0.999997      1046912    291271.11
     431.615     0.999997      1046912    327680.00
     433.663     0.999997      1046913    374491.43
     433.663     0.999998      1046913    436906.67
     448.511     0.999998      1046914    524288.00
     448.511     0.999998      1046914    582542.22
     448.511     0.999998      1046914    655360.00
     448.511     0.999999      1046914    748982.86
     448.511     0.999999      1046914    873813.33
     452.863     0.999999      1046915   1048576.00
     452.863     1.000000      1046915          inf
#[Mean    =       23.511, StdDeviation   =       40.130]
#[Max     =      452.608, Total count    =      1046915]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1047674 requests in 15.01s, 666.43MB read
Requests/sec:  69786.41
Transfer/sec:     44.39MB