docs/benchmark/results-wrk2/raw/nginx-R150000-r1.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.30ms  110.76ms 858.62ms   89.21%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.57ms
 75.000%   44.77ms
 90.000%  185.73ms
 99.000%  520.96ms
 99.900%  661.50ms
 99.990%  758.78ms
 99.999%  814.08ms
100.000%  859.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.092     0.000000            1         1.00
       1.146     0.100000       128432         1.11
       1.847     0.200000       256667         1.25
       3.299     0.300000       384899         1.43
       6.967     0.400000       513136         1.67
      11.567     0.500000       641486         2.00
      13.983     0.550000       705614         2.22
      17.279     0.600000       769848         2.50
      22.879     0.650000       833837         2.86
      31.983     0.700000       897918         3.33
      44.767     0.750000       962093         4.00
      53.855     0.775000       994177         4.44
      64.287     0.800000      1026180         5.00
      77.887     0.825000      1058282         5.71
      98.303     0.850000      1090355         6.67
     131.327     0.875000      1122380         8.00
     155.775     0.887500      1138443         8.89
     185.727     0.900000      1154504        10.00
     219.647     0.912500      1170489        11.43
     255.743     0.925000      1186506        13.33
     294.911     0.937500      1202590        16.00
     315.903     0.943750      1210612        17.78
     336.383     0.950000      1218591        20.00
     357.887     0.956250      1226664        22.86
     380.159     0.962500      1234638        26.67
     404.223     0.968750      1242640        32.00
     417.279     0.971875      1246656        35.56
     431.103     0.975000      1250649        40.00
     445.951     0.978125      1254650        45.71
     462.335     0.981250      1258710        53.33
     480.255     0.984375      1262693        64.00
     490.495     0.985938      1264699        71.11
     501.503     0.987500      1266677        80.00
     513.279     0.989062      1268700        91.43
     526.335     0.990625      1270727       106.67
     540.671     0.992188      1272697       128.00
     548.863     0.992969      1273683       142.22
     557.567     0.993750      1274720       160.00
     566.783     0.994531      1275704       182.86
     577.535     0.995313      1276709       213.33
     589.311     0.996094      1277714       256.00
     595.455     0.996484      1278206       284.44
     602.623     0.996875      1278720       320.00
     609.279     0.997266      1279197       365.71
     617.471     0.997656      1279711       426.67
     626.175     0.998047      1280198       512.00
     631.807     0.998242      1280455       568.89
     638.463     0.998437      1280721       640.00
     645.119     0.998633      1280946       731.43
     653.311     0.998828      1281203       853.33
     662.527     0.999023      1281447      1024.00
     667.647     0.999121      1281577      1137.78
     673.279     0.999219      1281701      1280.00
     678.911     0.999316      1281829      1462.86
     686.079     0.999414      1281955      1706.67
     692.735     0.999512      1282075      2048.00
     697.343     0.999561      1282138      2275.56
     702.463     0.999609      1282202      2560.00
     707.071     0.999658      1282265      2925.71
     714.751     0.999707      1282327      3413.33
     722.943     0.999756      1282389      4096.00
     728.063     0.999780      1282420      4551.11
     732.671     0.999805      1282452      5120.00
     738.303     0.999829      1282483      5851.43
     745.471     0.999854      1282512      6826.67
     752.127     0.999878      1282545      8192.00
     756.735     0.999890      1282562      9102.22
     759.807     0.999902      1282575     10240.00
     762.879     0.999915      1282593     11702.86
     766.463     0.999927      1282606     13653.33
     772.607     0.999939      1282624     16384.00
     774.143     0.999945      1282630     18204.44
     776.703     0.999951      1282637     20480.00
     782.335     0.999957      1282645     23405.71
     786.943     0.999963      1282653     27306.67
     792.575     0.999969      1282660     32768.00
     797.183     0.999973      1282665     36408.89
     799.231     0.999976      1282668     40960.00
     801.279     0.999979      1282674     46811.43
     802.815     0.999982      1282676     54613.33
     807.423     0.999985      1282680     65536.00
     812.031     0.999986      1282682     72817.78
     814.079     0.999988      1282686     81920.00
     814.079     0.999989      1282686     93622.86
     819.199     0.999991      1282688    109226.67
     820.735     0.999992      1282690    131072.00
     824.831     0.999993      1282691    145635.56
     827.391     0.999994      1282692    163840.00
     829.951     0.999995      1282693    187245.71
     834.047     0.999995      1282694    218453.33
     838.655     0.999996      1282695    262144.00
     838.655     0.999997      1282695    291271.11
     840.191     0.999997      1282696    327680.00
     840.191     0.999997      1282696    374491.43
     843.263     0.999998      1282697    436906.67
     843.263     0.999998      1282697    524288.00
     843.263     0.999998      1282697    582542.22
     845.823     0.999998      1282698    655360.00
     845.823     0.999999      1282698    748982.86
     845.823     0.999999      1282698    873813.33
     845.823     0.999999      1282698   1048576.00
     845.823     0.999999      1282698   1165084.44
     859.135     0.999999      1282699   1310720.00
     859.135     1.000000      1282699          inf
#[Mean    =       56.303, StdDeviation   =      110.764]
#[Max     =      858.624, Total count    =      1282699]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1282807 requests in 15.00s, 815.99MB read
Requests/sec:  85514.19
Transfer/sec:     54.40MB